<template>
  <div class="bg">
    <div class="container">

      <v-sheet class="rules" elevation='4' color="white">
        <h2>
          <v-icon large>mdi-camera </v-icon>
          Фото и видеоматериалы с прошедшего фестиваля
        </h2>
        <p>
          Если вы хотите получить фотографии без водяного знака, напишите номера фотографий нам на почту:
        </p>
        <p>
          <v-icon left>mdi-email</v-icon> brush.festival@gmail.com
        </p>
        <div class="media-cards">
          <div
            v-for="card in cards"
            :key="card.title"
            class="media-item"
          >
            <a :href="card.href" target="_blank">
              <v-card :hover="true">
                <v-img
                  :src="card.src"
                  class="white--text align-end"
                  gradient="to bottom, rgba(0,0,0,.1), rgba(0,0,0,.5)"
                  height="200px"
                >
                  <v-card-title v-text="card.title"></v-card-title>
                </v-img>
              </v-card>
            </a>
          </div>
        </div>
      </v-sheet>

      <v-sheet class="event" elevation='4' color="white">
        <div class="image">
          <img src="poster.jpg" alt="" class="poster">
        </div>
        <div class="info-block">
          <div class="info-list">
            <v-list disabled id="contacts">
              <v-list-item-group>
                <v-list-item
                  v-for="(item, i) in items"
                  :key="i"
                >
                  <v-list-item-icon>
                    <v-icon v-text="item.icon"></v-icon>
                  </v-list-item-icon>
                  <v-list-item-content>
                    <v-list-item-title v-text="item.text"></v-list-item-title>
                  </v-list-item-content>
                </v-list-item>
              </v-list-item-group>
            </v-list>
          </div>
          <iframe class="info-map" src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2242.534533899662!2d37.67041031552495!3d55.80131999571701!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x46b535be0f476dd1%3A0x79e01f70b9c2483f!2zNC3QuSDQm9GD0YfQtdCy0L7QuSDQv9GA0L7RgdC10LosIDQsINCc0L7RgdC60LLQsCwgMTA3MDE0!5e0!3m2!1sru!2sru!4v1570398421926!5m2!1sru!2sru" frameborder="0" style="border:0;" allowfullscreen=""></iframe>
        </div>
      </v-sheet>

      <v-sheet class="rules" id="rules" elevation='4' color="white">
        <h2>Положение</h2>

        <h3>ОБЩИЕ ПОЛОЖЕНИЯ:</h3>

        <p>Настоящее положение определяет порядок и регламент проведения танцевального фестиваля «BRUSH».</p>
        <p>Уникальный проект создан при поддержке Всероссийской федерации Танцевального спорта и акробатического рок-н-ролла, Министерства физической культуры, спорта, туризма и работы с молодежью Московской области, Союза танцевального спорта Московской области.</p>
        <p>Основными принципами конкурса являются: открытость, прозрачность критериев оценивания, коллегиальность принятия решений, равенство условий для всех участников.</p>

        <h3>1. ЦЕЛИ И ЗАДАЧИ:</h3>

        <h4>Цели:</h4>
        <ol>
          <li>Развитие творческого потенциала детских танцевальных коллективов бального и социального танцев;</li>
          <li>Знакомство с творчеством и исполнительским мастерством хореографических коллективов разных регионов России;</li>
          <li>Установление творческих контактов, обмен педагогическим опытом работы.</li>
        </ol>

        <h4>Задачи:</h4>
        <ul>
          <li>выявление и демонстрация творческого потенциала детских танцевальных коллективов бального и социального танца;</li>
          <li>развитие и популяризация бального и социального танца в сценическом прочтении;</li>
          <li>создание творческой атмосферы для профессионального общения участников фестиваля, обмена опытом и репертуаром;</li>
          <li>повышение профессионального уровня руководителей коллективов (проведение круглых столов для руководителей);</li>
          <li>объединение и взаимодействие руководителей, преподавателей, педагогов, участников детских и юношеских коллективов.</li>
        </ul>

        <h3>СРОКИ ПРОВЕДЕНИЯ: <i>1 декабря 2019 года.</i></h3>
        <h3>МЕСТО ПРОВЕДЕНИЯ: <i>м. Сокольники, 4-й лучевой просек 4, танцевальный зал «MYCLYB».</i></h3>

        <h3>2. УЧАСТНИКИ ФЕСТИВАЛЯ:</h3>
        <ol>
          <li>В фестивале принимают участи детские, молодёжные и взрослые творческие (танцевальные) коллективы из разных регионов России, представляющие бальную хореографию и социальный танец (независимо от ведомственной принадлежности).</li>
          <li>К участию допускаются коллективы как профессиональные, так и любительские (максимальное количество участников в коллективе не ограничено).</li>
        </ol>

        <h3>3. ВОЗРАСТНЫЕ КАТЕГОРИИ (ГРУППЫ):</h3>
        <ol>
          <li>младшая возрастная категория  (дети-1, дети-2) от 4 до 9 лет</li>
          <li>средняя возрастная категория (юниоры-1) от 10 до 12 лет</li>
          <li>старшая возрастная категория (юниоры-2) от 13 до 15 лет, молодёжь 16-18 лет</li>
          <li>молодежная возрастная категория (молодежь-2) до 21 года</li>
          <li>взрослые (22 и старше)</li>
        </ol>

        <h3>4. НОМИНАЦИИ КОНКУРСНОЙ ПРОГРАММЫ И КРИТЕРИИ ОЦЕНКИ:</h3>
        <ol>
          <li>Бальные танцевальные номера на основе Европейской и Латиноамериканской программ (2 номера)</li>
          <li>Социальный клубный танец (мамба, бачата, сальса, аргентинское танго и др.);</li>
          <li>Историко-бытовой танец (2 номера);</li>
          <li>Буги – вуги (социальный танец);</li>
          <li>Танцевальное шоу (сюжетный танец) 2 номера;</li>
          <li>American smooth;</li>
          <li>Секвей;</li>
          <li>Форейшн.</li>
        </ol>

        <h4>Формы (категории):</h4>
        <ul>
          <li>Соло;</li>
          <li>Дуэты;</li>
          <li>Малая форма (от 3-х до 6-ти человек);</li>
          <li>Ансамбли.</li>
        </ul>

        <h4>Критерии оценки:</h4>
        <ul>
          <li>Техника исполнения лексического материала;</li>
          <li>Композиционное построение номера, оригинальность балетмейстерского решения;</li>
          <li>Соответствие репертуара возрастным особенностям исполнителей;</li>
          <li>Подбор и соответствие музыкального материала;</li>
          <li>Артистизм исполнителей и раскрытие художественного образа;</li>
          <li>Соответствие костюма и художественного образа номера.</li>
        </ul>

        <h3>5. ОБЩИЕ ТЕХНИЧЕСКИЕ ТРЕБОВАНИЯ И УСЛОВИЯ УЧАСТИЯ В КОНКУРСЕ:</h3>
        <ol>
          <li>Выступления должны сопровождаться качественной фонограммой, музыкальной композицией, записанной на флеш-носителе в формате «wav» или «МР3» формате. Имейте дубликаты.</li>
          <li>Все фонограммы высылаются по электронной почте в оргкомитет конкурса после внесения оплаты организационного взноса с указанием названия коллектива, названия номера и авторов (исполнителя) музыкального произведения;</li>
          <li>Сопровождающие педагоги, руководители коллективов, родители (опекуны) несут полную ответственность за жизнь и здоровье участников;</li>
          <li>По правилам пожарной безопасности запрещается использовать пожароопасные предметы, в том числе пиротехнику, свечи, факелы, бенгальские огни, декорации и другие предметы, не соответствующие пожарной безопасности.</li>
          <li>Оргкомитет не несёт ответственности за неверно сообщённые или изменённые участником предоставленные сведения.</li>
          <li>Оргкомитет имеет право прекратить приём заявок в любое время, если лимит участников конкурса исчерпан.</li>
        </ol>

        <h3>7. УСЛОВИЯ УЧАСТИЯ:</h3>
        <ol>
          <li>Коллективы (участники) обязаны представить в номинации и возрастной категории по два номера (есть исключение по номинациям);</li>
          <li>Общая продолжительность представленных номеров в каждой номинации не должна превышать 10 мин.;</li>
          <li>Общая продолжительность представленных номеров построенных по правилам и требованиям «Формейшн» не должна превышать 12 мин.</li>
        </ol>

        <h3>8. ЖЮРИ ФЕСТИВАЛЯ «BRUSH»:</h3>
        <p>Жюри фестиваля формируется из ведущих специалистов и деятелей культуры и спортивного бального танца, а также ведущих педагогов известнейших ВУЗов.</p>

        <h3>ФИНАНСОВЫЕ УСЛОВИЯ ФЕСТИВАЛЯ</h3>
        <h4>Благотворительный целевой взнос.</h4>

        <h4 class="red--text">В День Рождения фестиваля мы дарим Вам скидку на участие в размере 40%.</h4>

        <ul>
          <li>Соло – <span class="red--text">1800</span> (<s>3000</s>) руб. с человека за 2 номера</li>
          <li>Дуэт – <span class="red--text">1200</span> (<s>2000</s>) руб. с человека за 2 номера</li>
          <li>Малая форма – <span class="red--text">1500</span> (<s>2500</s>) руб. с человека за 2 номера</li>
          <li>До 10 человек – <span class="red--text">1200</span> (<s>2000</s>) руб. с человека за 2 номера</li>
          <li>Свыше 11 человек – <span class="red--text">960</span> (<s>1600</s>) руб. с человека за 2 номера</li>
          <li>Секвей – <span class="red--text">2400</span> (<s>4000</s>) руб. с пары за 1 номер</li>
        </ul>

        <h4>ВХОД для зрителей, родителей и сопровождающих лиц БЕСПЛАТНО.</h4>

        <h4>Порядок и сроки подачи заявок:</h4>
        <ul>
          <li>Заявки принимаются в электронном виде (<a href="https://forms.gle/UKpj82JGUBMz9Kvd6">cсылка на заявку</a>).</li>
          <li>Заявки принимаются до 29-го ноября (включительно).</li>
        </ul>

        <h4>Программа фестиваля будет выслана по факту формирования заявок на электронный адрес.</h4>

        <p>По дополнительным вопросам обращаться по телефону:</p>
        <p>8 (903) 798-41-02 – Николай Валентинович</p>

      </v-sheet>
    </div>
  </div>
</template>

<script>
  export default {
    data: () => ({
      items: [
        { text: '1 декабря 2019г.', icon: 'mdi-calendar' },
        { text: 'Москва, 4-й Лучевой просек, 4', icon: 'mdi-city' },
        { text: 'kopytnikoff@yandex.ru', icon: 'mdi-email' },
        { text: '8(903)798-41-02 (Николай Валентинович)', icon: 'mdi-phone' },
      ],
      cards: [
        { title: 'Массовый спорт',
          src: 'media/comp.jpg',
          href: 'https://drive.google.com/open?id=1mlzTl_Xeelg30ez0eA5ppRbY7oFNV7H3',
        },
        { title: 'Ансамбли',
          src: 'media/fest.jpg',
          href: 'https://drive.google.com/open?id=1Ea5WFe0PVunGKnpnNkF2lu4XQ6EbGAvV',
        },
        { title: 'Видео',
          src: 'media/video.jpg',
          href: 'https://www.youtube.com/playlist?list=PLqKyk6IE64I9AIEXIZR_zDXueV-etUtcX',
        },
      ],
    }),
  }
</script>

<style lang="scss" scoped>
  .bg {
    background-color: #eee;
  }
  .container {
    max-width: 960px;
  }
  .media-cards {
    display: flex;
    flex-wrap: wrap;
    justify-content: space-between;
    .media-item {
      width: calc(100% / 3.1);
    }
    a {
      text-decoration: none;
    }
  }
  .event {
    margin: 1em 0 2em;
  }
  .poster {
    display: block;
    width: 100%;
  }
  .info-block {
    width: 100%;
  }
  .info-map {
    display: block;
    width: 100%;
    min-height: 200px;
  }
  @media (min-width: 500px) {
    .event {
      display: -webkit-flex;
      display: -ms-flex;
      display: flex;
      width: 100%;
    }
    .image {
      flex: 0 0 40%;
    }
    .info-block {
      display: -webkit-flex;
      display: -ms-flex;
      display: flex;
      flex-direction: column;
      justify-content: space-between;
      .v-list {
        padding: 0;
      }
      .info-map {
        flex: 1 1 auto;
      }
    }
  }
  .rules {
    padding: 1em;
    margin: 2em 0 3em;
    h2,
    h3,
    h4,
    ul,
    ol {
      margin-top: .25em;
      margin-bottom: .5em;
    }
    h3 {
      margin-top: 1em;
      margin-bottom: .5em;
    }
  }
  @media (min-width: 500px) {
    .rules {
      padding: 2em;
    }
  }
</style>
